In [2]:
from sqlalchemy import create_engine
import pandas as pd
from getpass import getpass  # To get the password without showing the input

import matplotlib
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
#sns.set_theme(style="whitegrid")

In [6]:
password = getpass("INSERT YOUR F*KING PASSWORD: ")

INSERT YOUR F*KING PASSWORD: ········

### Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

	- Check the number of rentals for each customer for May

	- Check the number of rentals for each customer for June

##### Hint: You can store the results from the two queries in two separate dataframes.

In [7]:
# this is the general syntax 'dialect+driver://username:password@host:port/database'
# to create the connection string
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
engine = create_engine(connection_string)

In [8]:
rentals_may = pd.read_sql_query('SELECT * FROM sakila.rentals_may', engine)
rentals_may.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24,367,130,2005-05-26,1,2006-02-15
1,2,2005-05-24,1525,459,2005-05-28,1,2006-02-15
2,3,2005-05-24,1711,408,2005-06-01,1,2006-02-15
3,4,2005-05-24,2452,333,2005-06-03,2,2006-02-15
4,5,2005-05-24,2079,222,2005-06-02,1,2006-02-15

In [9]:
rentals_june = pd.read_sql_query('SELECT * FROM sakila.rentals_june', engine)
rentals_june.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14,1632,416,2005-06-18,2,2006-02-15
1,1159,2005-06-14,4395,516,2005-06-17,1,2006-02-15
2,1160,2005-06-14,2795,239,2005-06-18,2,2006-02-15
3,1161,2005-06-14,1690,285,2005-06-21,1,2006-02-15
4,1162,2005-06-14,987,310,2005-06-23,1,2006-02-15

In [10]:
print("Rentals_may has {} rows and {} columns".format(rentals_may.shape[0],rentals_may.shape[1]))
print()
print("The data types of each column of rentals_may are:")
print(rentals_may.dtypes)
print()

Rentals_may has 1156 rows and 7 columns

The data types of each column of rentals_may are:
rental_id        int64
rental_date     object
inventory_id     int64
customer_id      int64
return_date     object
staff_id         int64
last_update     object
dtype: object

In [11]:
print("Rentals_june has {} rows and {} columns".format(rentals_june.shape[0],rentals_june.shape[1]))
print()
print("The data types of each column of rentals_june are:")
print(rentals_june.dtypes)
print()

Rentals_june has 2311 rows and 7 columns

The data types of each column of rentals_june are:
rental_id        int64
rental_date     object
inventory_id     int64
customer_id      int64
return_date     object
staff_id         int64
last_update     object
dtype: object

In [12]:
df_may = pd.DataFrame({'customer_id': rentals_may["customer_id"].unique(),
                   'num_rentals': rentals_may["customer_id"].value_counts(sort=False)})
df_may

     customer_id  num_rentals
130          130            2
459          459            1
408          408            3
333          333            1
222          222            5
..           ...          ...
191          191            2
351          351            1
10            10            1
136          136            1
61            61            1

[520 rows x 2 columns]

In [13]:
rentals_may = rentals_may.merge(df_may, on="customer_id", how="left")
rentals_may.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,num_rentals
0,1,2005-05-24,367,130,2005-05-26,1,2006-02-15,2
1,2,2005-05-24,1525,459,2005-05-28,1,2006-02-15,1
2,3,2005-05-24,1711,408,2005-06-01,1,2006-02-15,3
3,4,2005-05-24,2452,333,2005-06-03,2,2006-02-15,1
4,5,2005-05-24,2079,222,2005-06-02,1,2006-02-15,5

In [14]:
df_june = pd.DataFrame({'customer_id': rentals_june["customer_id"].unique(),
                   'num_rentals': rentals_june["customer_id"].value_counts(sort=False)})
rentals_june = rentals_june.merge(df_june, on="customer_id", how="left")
rentals_june.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,num_rentals
0,1158,2005-06-14,1632,416,2005-06-18,2,2006-02-15,5
1,1159,2005-06-14,4395,516,2005-06-17,1,2006-02-15,6
2,1160,2005-06-14,2795,239,2005-06-18,2,2006-02-15,5
3,1161,2005-06-14,1690,285,2005-06-21,1,2006-02-15,3
4,1162,2005-06-14,987,310,2005-06-23,1,2006-02-15,6

In [15]:
MayJune_rentals = df_may.merge(df_june, on="customer_id", how="outer")
MayJune_rentals.head()

   customer_id  num_rentals_x  num_rentals_y
0          130            2.0            6.0
1          459            1.0            7.0
2          408            3.0            3.0
3          333            1.0            4.0
4          222            5.0            2.0

### Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

##### Hint: For this part, you can create a join between the two dataframes created before, using the merge function available for pandas dataframes. Here is a link to the documentation for the merge function.

In [16]:
MayJune_rentals = MayJune_rentals.rename(columns={"num_rentals_x":"rentals_may","num_rentals_y":"rentals_june"})
MayJune_rentals.columns

Index(['customer_id', 'rentals_may', 'rentals_june'], dtype='object')

In [17]:
def borrow(id):
    for i in range(0,len(MayJune_rentals["customer_id"])):
        if MayJune_rentals["customer_id"][i] == id:
            if MayJune_rentals["rentals_may"][i]>MayJune_rentals["rentals_june"][i]:
                print("Customer ", id, " rented more films in May.", MayJune_rentals["rentals_may"][i], "in May against ", MayJune_rentals["rentals_june"][i], " in June." )
            elif MayJune_rentals["rentals_may"][i]<MayJune_rentals["rentals_june"][i]:
                print("Customer ", id, " rented more films in June.", MayJune_rentals["rentals_may"][i], "in May against ", MayJune_rentals["rentals_june"][i], " in June." )
            else:
                print("Customer ", id, " rented the same films")

In [18]:
borrow(130) #we provide the id and it returns the answer

Customer  130  rented more films in June. 2.0 in May against  6.0  in June.

In [19]:
borrow(222)

Customer  222  rented more films in May. 5.0 in May against  2.0  in June.

In [20]:
borrow(408)

Customer  408  rented the same films